Revit 2027 API
ParameterTypeId.RebarSystemHookTypeBottomDirn1 Property
 "Bottom Major Hook Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarSystemHookTypeBottomDirn1 { get; }
Public Shared ReadOnly Property RebarSystemHookTypeBottomDirn1 As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarSystemHookTypeBottomDirn1 {
	ForgeTypeId^ get ();
}
static member RebarSystemHookTypeBottomDirn1 : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace